# Parameter Type Id Instance Length Param Property

Source: https://www.revitapidocs.com/2026/3f72138a-62c2-cb73-3d33-034607dcbbd8.htm

---

| Parameter Type Id Instance Length Param Property |
| --- |

"System Length"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId InstanceLengthParam { get; }
```

```
Public Shared ReadOnly Property InstanceLengthParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ InstanceLengthParam {
	ForgeTypeId^ get ();
}
```

```
static member InstanceLengthParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace